# 转发和路由

## 转发
当数据包到达路由器时，根据查找数据包的目标地址，查找下一跳路由器的Ip地址，并通过这个信息找到对应的output link
，将数据包转发到下一跳路由的过程，侧重的是路由器内部的转发操作

当网络上的两台主机HostA和HostB，HostA要发送数据包给HostB，那么流程如下所示：
HostA –> router1 –> router2 –> router3 –> … –> routerN –> HostB
上述流程展示了，数据包要从HostA最终到达HostB，要经过N个路由器，这里的routerN是routerN-1的下一跳路由器（N>1）。

也就是说，数据包要到达对端，需要从HostA开始，路由器不断找到下一跳路由器的地址，并转发给他，一跳接一跳地进行，
最终送达目的端。其中routerN-1的输出端口和routerN的输入端口相连，我们的Forwarding就是当数据包到达routerN-1时，

通过路由表和路由算法选出合适的输出端口，再通过链路输出到routerN的输入端口的过程。每个路由器的网络接口都绑定一个IP地址，
如上所示的router左右两端分别有一个网络接口，各绑定一个IP地址。

## 路由
描述数据包从发送端到接收端的路径，以及通过路由表生成算法生成路由表的这种行为，侧重整个路由路径的生成和管理

## 路由和转发的区别：
路由即对使用哪一条路径做出决策
转发则是当异构数据包到达时应该采取什么动作

### 路由算法
负责确定异构入境数据包应该被发送到哪一条输出线路上

非自适应算法（静态的）预先分配好的

自适应的（动态）根据当前测量或者估计的流量和拓扑结构来调整路由决策

#### 最短路径算法
#### 泛洪算法
#### 距离矢量算法


